-- Создание таблицы B 
CREATE TABLE B (
    a VARCHAR(10),
    C VARCHAR(10), 
    d VARCHAR(10) 
);

-- Вставка данных в таблицу B
INSERT INTO b (a, c, d) VALUES
('Картофель', 'Овощи', '90'),
('Помидоры', 'Овощи', '150'),
('Огурцы', 'Овощи', '130'),
('Апельсины', 'Фрукты', '220'),
('Лимоны', 'Фрукты', '240'),
('Сок', 'Напитки', '180'),
('Вода', 'Напитки', '50'),
('Йогурт', 'Молочные', '120'),
('Колбаса', 'Мясные', '450'),
('Курица', 'Мясные', '600');

--Запрос для выборки непересекающихся значений из таблиц A и B
(
    SELECT c FROM a
    EXCEPT
    SELECT c FROM b
)

UNION
(
    SELECT c FROM b
    EXCEPT
    SELECT c FROM a
);
